In [100]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are meant
to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
these missing numbers and make the column an integer column (instead of a float
column).

In [103]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
print(df)
print(type(df['FlightNumber'][0]))

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"
<class 'numpy.int32'>

2. The From_To column would be better as two separate columns! Split each string on
the underscore delimiter _ to give a new temporary DataFrame with the correct values.
Assign the correct column names to this temporary DataFrame.

In [92]:
temp_df=pd.DataFrame()
temp_df['From'] = df['From_To'].str.split('_').str[0]
temp_df['To'] = df['From_To'].str.split('_').str[1]
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary
DataFrame. Standardise the strings so that only the first letter is uppercase (e.g.
"londON" should become "London".)

In [93]:
temp_df['From']=temp_df['From'].str.title()
temp_df['To']=temp_df['To'].str.title()
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame from the
previous questions.

In [94]:
df.pop('From_To')
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [95]:
df[['From','To']]=temp_df[['From','To']]
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the DataFrame as a
list. We would like each first value in its own column, each second value in its own
column, and so on. If there isn't an Nth value, the value should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns delay_1,
delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [99]:
temp_list=list(df['RecentDelays'])
print(temp_list)
print("*"*80)
temp_delays_frozen = pd.DataFrame(temp_list)
delays = temp_delays_frozen.drop(0, 1).join(pd.DataFrame(temp_delays_frozen[0].values.tolist()))
print(delays)
print("*"*80)
delays.columns=['column delay_1','column delay_2','column delay_3']
print("*"*80)
df = df.drop('RecentDelays', 1)
df.insert(3, "Delay_1", delays['column delay_1'])
df.insert(4, "Delay_2", delays['column delay_2'])
df.insert(5, "Delay_3", delays['column delay_3'])
print("*"*80)
print(df)

[[23, 47], [], [24, 43, 87], [13], [67, 32]]
********************************************************************************
      1     2     0
0  47.0   NaN  23.0
1   NaN   NaN   NaN
2  43.0  87.0  24.0
3   NaN   NaN  13.0
4  32.0   NaN  67.0
********************************************************************************
********************************************************************************
********************************************************************************
            From_To  FlightNumber              Airline  Delay_1  Delay_2  \
0      LoNDon_paris       10045.0               KLM(!)     47.0      NaN
1      MAdrid_miLAN           NaN    <Air France> (12)      NaN      NaN
2  londON_StockhOlm       10065.0  (British Airways. )     43.0     87.0
3    Budapest_PaRis           NaN       12. Air France      NaN      NaN
4   Brussels_londOn       10085.0          "Swiss Air"     32.0      NaN

   Delay_3
0     23.0
1      NaN
2     24.0
3     13.0
4     67.0

"end of assignment"